frontend/packages/performance-testing/scripts/observation-performance.yaml
config:
  target: "{{ $env.FHIR_R4_URL }}"
  processor: "../helpers.mjs"
  phases:
    - arrivalRate: 140
      duration: 30

before:
  flow:
    - function: "generateAuthToken"

scenarios:
  - flow:
      - post:
          headers:
            Authorization: "Bearer {{ sharedToken }}"
            Content-Type: "application/fhir+json"
          url: "/Observation"
          json:
            {
              "resourceType": "Observation",
              "identifier":
                [
                  {
                    "use": "official",
                    "system": "http://www.bmc.nl/zorgportal/identifiers/observations",
                    "value": "6325",
                  },
                ],
              "status": "final",
              "code":
                {
                  "coding":
                    [
                      {
                        "system": "http://loinc.org",
                        "code": "11557-6",
                        "display": "Carbon dioxide in blood",
                      },
                    ],
                },
              "subject": { "reference": "Patient/noO83wMVGPs2LDH2Dqd0KB" },
              "effectivePeriod":
                {
                  "start": "2013-04-02T10:30:10+01:00",
                  "end": "2013-04-05T10:30:10+01:00",
                },
              "issued": "2013-04-03T15:30:10+01:00",
              "performer":
                [
                  {
                    "reference": "Practitioner/f005",
                    "display": "A. Langeveld",
                  },
                ],
              "valueQuantity":
                {
                  "value": 6.2,
                  "unit": "kPa",
                  "system": "http://unitsofmeasure.org",
                  "code": "kPa",
                },
              "interpretation":
                [
                  {
                    "coding":
                      [
                        {
                          "system": "http://terminology.hl7.org/CodeSystem/v3-ObservationInterpretation",
                          "code": "H",
                          "display": "High",
                        },
                      ],
                  },
                ],
              "referenceRange":
                [
                  {
                    "low":
                      {
                        "value": 4.8,
                        "unit": "kPa",
                        "system": "http://unitsofmeasure.org",
                        "code": "kPa",
                      },
                    "high":
                      {
                        "value": 6.0,
                        "unit": "kPa",
                        "system": "http://unitsofmeasure.org",
                        "code": "kPa",
                      },
                  },
                ],
            }